const translations = {
    "kh-kk": "Кох Конг",
    "kh-pp": "Пномпень",
    "kh-ka": "Преах Сиханук",
    "kh-om": "Бантьяй Мянчей",
    "kh-ba": "Баттамбанг",
    "kh-po": "Пурсат",
    "kh-si": "Сиемреап",
    "kh-oc": "Оддар Мянчей",
    "kh-pl": "Пайлин",
    "kh-km": "Кампонг Чам",
    "kh-kg": "Кампонг Чнанг",
    "kh-kn": "Кандал",
    "kh-ks": "Кампонг Спёу",
    "kh-kt": "Кампонг Том",
    "kh-py": "Прей Венг",
    "kh-ph": "Преах Вихеар",
    "kh-st": "Стунг Тренг",
    "kh-kh": "Крачех",
    "kh-mk": "Мондулкири",
    "kh-ro": "Ратанакири",
    "kh-kp": "Кампот",
    "kh-ke": "Кеп",
    "kh-sr": "Свай Риенг",
    "kh-ta": "Такео"
};

function getTranslation(key) {
    return translations[key] || key;
}
